# language: ru

@navigation @smoke
Функция: Навигация по приложению
  Как авторизованный пользователь
  Я хочу иметь возможность перемещаться по приложению
  Чтобы эффективно использовать все функции

  Предыстория:
    Когда пользователь открывает страницу логина
    И пользователь выполняет вход как стандартный пользователь
    То пользователь перенаправлен на страницу каталога

  @TC-028
  @smoke
  @positive
  Сценарий: TC-028 Logout через меню
    Когда пользователь открывает меню
    И пользователь нажимает "Logout" в меню
    То отображается страница логина

  @TC-029
  @positive
  Сценарий: TC-029 Пункт меню 'All Items'
    Когда пользователь добавляет товар "sauce-labs-backpack" в корзину
    И пользователь нажимает кнопку корзины
    То отображается страница корзины
    Когда пользователь открывает меню
    И пользователь нажимает "All Items" в меню
    То пользователь перенаправлен на страницу каталога

  @TC-030
  @e2e
  @positive
  @critical
  Сценарий: TC-030 Сброс состояния приложения через Reset App State
    Когда пользователь добавляет товар "sauce-labs-backpack" в корзину
    И пользователь добавляет товар "sauce-labs-bike-light" в корзину
    То значок корзины показывает 2
    Когда пользователь открывает меню
    И пользователь нажимает "Reset App State" в меню
    И пользователь закрывает меню
    То значок корзины не отображается
    И все кнопки "Add to cart" видны
